# 05 Membalik urutan baris dan kolom pada Data Frame

Import Modules

In [2]:
import pandas as pd 
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

Persiapan Data Frame

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                 columns=cols)

df

   A  B  C  D  E
0  2  3  3  3  5
1  1  1  3  9  1
2  5  2  1  9  4
3  2  6  9  8  2
4  1  7  4  4  3

Membalik Urutan Kolom

In [5]:
df.loc[:, ::-1]

   E  D  C  B  A
0  5  3  3  3  2
1  1  9  3  1  1
2  4  9  1  2  5
3  2  8  9  6  2
4  3  4  4  7  1

Membalik Urutan Baris

In [7]:
df.loc[::-1, :]

   A  B  C  D  E
4  1  7  4  4  3
3  2  6  9  8  2
2  5  2  1  9  4
1  1  1  3  9  1
0  2  3  3  3  5

Membalik urutan baris dan melakukan penyesuaian ulang index

In [8]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  1  7  4  4  3
1  2  6  9  8  2
2  5  2  1  9  4
3  1  1  3  9  1
4  2  3  3  3  5